In [6]:
"hello Mike".find("Mike")

6

In [7]:
ciao="ciao"

stringa="Prova {}".format(ciao)
print(stringa)

stringona=f"Prova {ciao}"
print(stringona)

Prova ciao
Prova ciao

In [8]:
# using Try- except 
try:
    # Attempting to divide 10 by 0
    result = 10 / 0
except ZeroDivisionError:
    # Handling the ZeroDivisionError and printing an error message
    print("Error: Cannot divide by zero")
# This line will be executed regardless of whether an exception occurred
print("outside of try and except block")

Error: Cannot divide by zero
outside of try and except block

In [9]:
"""a=10
b=0
try:
    print(a/b)
except error:
    print("Stai dividendo per zero, somaro")
"""

'a=10\nb=0\ntry:\n    print(a/b)\nexcept error:\n    print("Stai dividendo per zero, somaro")\n'

In [10]:
a=1

def do(x):
    a=100
    return(x+a)

print(do(1))

101

In [11]:
"""
Write a function name add that takes two parameter a and b, then return the output of  a + b 
(Do not use any other variable! You do not need to run it. Only write the code about how you define it.)
"""

'\nWrite a function name add that takes two parameter a and b, then return the output of  a + b \n(Do not use any other variable! You do not need to run it. Only write the code about how you define it.)\n'

In [12]:
def add(a,b):
    c=a+b
    return c

In [13]:
add(1,2)

3

In [14]:
testo="data/Testo.txt"
file=open(testo, "r")

In [15]:
filecontent=file.read()

In [16]:
filecont=file.readline()

In [17]:
file.close()

In [18]:
testo="data/Testo.txt"
file=open(testo, "r")
filecont1=file.readlines()
print(filecont1)

['Lorem ipsum is placeholder text\n', 'commonly used in the graphic, print, and publishing industries\n', 'for previewing layouts and visual mockups./nSo how did the classical Latin become so incoherent?\n', "According to McClintock, a 15th century typesetter likely scrambled part of Cicero's De Finibus in order to provide placeholder text to mockup various fonts for a type specimen book.\n", "It's difficult to find examples of lorem ipsum in use before Letraset made it popular as a dummy text in the 1960s, although McClintock says he remembers coming across the lorem ipsum passage in a book of old metal type samples. So far he hasn't\n", 'Testo di prova,Testo di prova,Testo di prova,Testo di prova\n', 'Testo di provaLorem ipsum is placeholder text\n', 'commonly used in the graphic, print, and publishing industries\n', 'for previewing layouts and visual mockups./nSo how did the classical Latin become so incoherent?\n']

In [19]:
with open(testo, "r") as file:
    filecont1=file.readlines()

In [20]:
lista=["Lorem ipsum is placeholder text\n", 
        "commonly used in the graphic, print, and publishing industries\n", 
        "for previewing layouts and visual mockups./n",
        "So how did the classical Latin become so incoherent?\n", 
        "According to McClintock, a 15th century typesetter likely scrambled part of Cicero's De Finibus in order to provide placeholder text to mockup various fonts for a type specimen book.\n",
        "It's difficult to find examples of lorem ipsum in use before Letraset made it popular as a dummy text in the 1960s, although McClintock says he remembers coming across the lorem ipsum passage in a book of old metal type samples. So far he hasn't\n"]
with open(testo, "w") as file:
    for n in lista:
        file.writelines(n)

In [21]:
with open(testo, "r") as text:
    print(text.readlines())

['Lorem ipsum is placeholder text\n', 'commonly used in the graphic, print, and publishing industries\n', 'for previewing layouts and visual mockups./nSo how did the classical Latin become so incoherent?\n', "According to McClintock, a 15th century typesetter likely scrambled part of Cicero's De Finibus in order to provide placeholder text to mockup various fonts for a type specimen book.\n", "It's difficult to find examples of lorem ipsum in use before Letraset made it popular as a dummy text in the 1960s, although McClintock says he remembers coming across the lorem ipsum passage in a book of old metal type samples. So far he hasn't\n"]

In [22]:
lista=["Lorem ipsum is placeholder text\n", 
        "commonly used in the graphic, print, and publishing industries\n", 
        "for previewing layouts and visual mockups./n",
        "So how did the classical Latin become so incoherent?\n"]

In [23]:
with open("data/Nuovofile.txt", "w") as file:
    i=0
    while i<100:
        file.write(f"Sovrascittura numero {i}\n")
        i+=1

In [24]:
import pandas as pd

In [25]:
x = {'Name': ['Rose','John', 'Jane', 'Mary'], 'ID': [1, 2, 3, 4], 'Department': ['Architect Group', 'Software Group', 'Design Team', 'Infrastructure'], 
      'Salary':[100000, 80000, 50000, 60000]}

In [26]:
df=pd.DataFrame(x)

In [27]:
df

   Name  ID       Department  Salary
0  Rose   1  Architect Group  100000
1  John   2   Software Group   80000
2  Jane   3      Design Team   50000
3  Mary   4   Infrastructure   60000

In [28]:
type(df["Name"])

pandas.core.series.Series

In [29]:
df[["ID","Name","Salary"]]

   ID  Name  Salary
0   1  Rose  100000
1   2  John   80000
2   3  Jane   50000
3   4  Mary   60000

In [30]:
py_dict={"Student":["David","Samuel", "Terry","Evan"],
         "Age":[27,24,22,32],
         "Country":["UK","Canada","China","USA"],
         "Course":["Python", "Data structures", "Machine learning","Web development"],
         "Marks":[85,72,89,76]
         }

In [31]:
py_df=pd.DataFrame(py_dict)

In [32]:
py_df

  Student  Age Country            Course  Marks
0   David   27      UK            Python     85
1  Samuel   24  Canada   Data structures     72
2   Terry   22   China  Machine learning     89
3    Evan   32     USA   Web development     76

In [33]:
B=py_df[["Marks"]]

In [34]:
B

   Marks
0     85
1     72
2     89
3     76

In [35]:
C=py_df[["Country", "Course"]]

In [36]:
C

  Country            Course
0      UK            Python
1  Canada   Data structures
2   China  Machine learning
3     USA   Web development

In [37]:
df.loc[0,"Salary"]

100000

In [38]:
df2=df.set_index("Name")

In [39]:
df2

      ID       Department  Salary
Name
Rose   1  Architect Group  100000
John   2   Software Group   80000
Jane   3      Design Team   50000
Mary   4   Infrastructure   60000

In [40]:
df2.loc["Jane", "Salary"]

50000

In [41]:
df2

      ID       Department  Salary
Name
Rose   1  Architect Group  100000
John   2   Software Group   80000
Jane   3      Design Team   50000
Mary   4   Infrastructure   60000

In [42]:
df

   Name  ID       Department  Salary
0  Rose   1  Architect Group  100000
1  John   2   Software Group   80000
2  Jane   3      Design Team   50000
3  Mary   4   Infrastructure   60000

In [44]:
df.loc[1, "Department"]

'Software Group'

In [45]:
df.iloc[1, 2]

'Software Group'

In [46]:
df[["Name", "ID", "Department"]].loc[2:3]

   Name  ID      Department
2  Jane   3     Design Team
3  Mary   4  Infrastructure

In [47]:
df.loc[2:3, "Name":"Department"]

   Name  ID      Department
2  Jane   3     Design Team
3  Mary   4  Infrastructure